OdGiDrawableOverrule.regenSupportFlags(OdGiDrawable!System.Runtime.CompilerServices.IsConst*)
\details
Overrules the regen support flags.
\param pSubject [in]  A raw pointer to the drawable object.
\returns
0 if the drawable can be rendered only in a single threaded mode or a set of flags as OdUInt32 value.

OdGiDrawableOverrule.viewportDrawLogicalFlags(OdGiDrawable!System.Runtime.CompilerServices.IsConst*,OdGiViewportDraw*)
\details
Overrules the OdGiDrawable::viewportDrawLogicalFlags() method and calls it in the default implementation.
\param pSubject [in]  A raw pointer to the drawable object.
\param vd [in]  A pointer to the Gi viewport drawable object.
\returns
setAttributes flags for the specified viewportDraw.

OdGiDrawableOverrule.viewportDraw(OdGiDrawable!System.Runtime.CompilerServices.IsConst*,OdGiViewportDraw*)
\details
Overrules the OdGiDrawable::viewportDraw() method and calls it in the default implementation.
\param pSubject [in]  A raw pointer to the drawable object.
\param vd [in]  A pointer to the Gi viewport drawable object.

OdGiDrawableOverrule.worldDraw(OdGiDrawable!System.Runtime.CompilerServices.IsConst*,OdGiWorldDraw*)
\details
Overrules the OdGiDrawable::worldDraw() method and calls it in the default implementation.
\param pSubject [in]  A raw pointer to the drawable object.
\param wd [in]  A pointer to the Gi world drawable object.
\returns
true if the geometric representation can be generated in a
viewport-independent manner.

OdGiDrawableOverrule.setAttributes(OdGiDrawable!System.Runtime.CompilerServices.IsConst*,OdGiDrawableTraits*)
\details
Overrules the OdGiDrawable::setAttributes() method and calls it in the default implementation.
\param pSubject [in]  A raw pointer to the drawable object.
\param traits [in]  A pointer to the graphics traits.
\returns
0 from the default implementation of the OdGiDrawable::setAttributes() method.

OdGiDrawableOverrule.#ctor
\details
Constructor creates an instance of this class.